str1="{}{}{}".format("圆周率是","3.1415926",".....")
print(str1)
str2="圆周率{1}{2}是{0}".format("无理数","3.1415926",".....") #可索引不同位置的字符
print(str2)

#填充
s="PYTHON"
print("使用空格填充")
print("{0:30}".format(s))   #填充到30位宽度 默认用空格
print("右对齐显示")
print("{0:>30}".format(s))
print("使用*号填充，并且居中显示")
print("{0:*^30}".format(s)) # ^表示居中

#格式控制标记，显示千分位
print("\n显示千分位")
print("{0:_^20,}".format(1234567890))

# 浮点数输出小数位数控制
print("\n显示2位小数")
print("{0:.2f}".format(123456.1212))

#显示不同类型
print("\n一个数在不同类型的表示")
print("{0:b},{0:c},{0:d},{0:o},{0:x},{0:X}".format(425))